# ElementsDeletedPastedToKeep Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..EditingFailures..::..ElementsDeletedPastedToKeep Property
BuiltInFailures..::..EditingFailures Class See Also
---
Elements were deleted. Use Edit Pasted Elements to keep them.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId ElementsDeletedPastedToKeep { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property ElementsDeletedPastedToKeep As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ ElementsDeletedPastedToKeep {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..EditingFailures Class
Autodesk.Revit.DB Namespace